; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph0 - mode
	image1 - mode
	Star13 - direction
	Star0 - direction
	GroundStation11 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star2 - direction
	Star14 - direction
	GroundStation12 - direction
	GroundStation5 - direction
	Star9 - direction
	Star1 - direction
	GroundStation10 - direction
	GroundStation7 - direction
	Star3 - direction
	GroundStation8 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star13)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star14)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star1)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument7 spectrograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 Star14)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation7)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 GroundStation12)
	(supports instrument10 image1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 GroundStation7)
	(calibration_target instrument10 GroundStation10)
	(calibration_target instrument10 Star1)
	(supports instrument11 image1)
	(calibration_target instrument11 GroundStation8)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
)
(:goal (and
	(pointing satellite2 GroundStation6)
	(pointing satellite3 Phenomenon17)
	(have_image Phenomenon15 image1)
	(have_image Phenomenon16 spectrograph0)
	(have_image Phenomenon17 spectrograph0)
	(have_image Star18 spectrograph0)
	(have_image Planet20 image1)
	(have_image Star21 image1)
))

)

; plan
1. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 8
2. (calibrate satellite2 instrument8 groundstation8)
   added: (calibrated instrument8)
   goals met: 0 of 8
3. (turn_to satellite2 planet20 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 planet20)
   goals met: 0 of 8
4. (take_image satellite2 planet20 instrument8 image1)
   added: (have_image planet20 image1)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon17 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 phenomenon17)
   goals met: 1 of 8
6. (take_image satellite2 phenomenon17 instrument8 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon16 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon16 instrument8 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon15 instrument8 image1)
   added: (have_image phenomenon15 image1)
   goals met: 4 of 8
11. (turn_to satellite2 star18 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star18)
   goals met: 4 of 8
12. (take_image satellite2 star18 instrument8 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 5 of 8
13. (turn_to satellite2 star21 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star21)
   goals met: 5 of 8
14. (take_image satellite2 star21 instrument8 image1)
   added: (have_image star21 image1)
   goals met: 6 of 8
15. (turn_to satellite2 groundstation6 star21)
   deleted: (pointing satellite2 star21)
   added: (pointing satellite2 groundstation6)
   goals met: 7 of 8
16. (turn_to satellite3 phenomenon17 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 phenomenon17)
   goals met: 8 of 8
